# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [53]:
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [56]:
a = pd.Series([100, 200, 300, 400])

Print a, and data type

In [57]:
print(a)

0    100
1    200
2    300
3    400
dtype: int64

Using indexing access the element 300 from the series a.

In [4]:
print(a[2])

300

What are the values of index for series a?

In [58]:
a.index

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [60]:

a.index = ['c', 'a', 'b', 'd']
print(a)

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [61]:
a['d']

400

Sort the values wrt to the index and print it

In [62]:
a = a.sort_index()
print(a)

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [63]:
b = pd.Series([800, 450, 100], index=['e', 'f', 'g'])
print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [64]:
a = pd.concat([a,b])

In [65]:
#print a again after appending b into it

print(a)

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [66]:

a = a.sort_values(ascending=False)
print(a.index)

Index(['e', 'f', 'd', 'b', 'a', 'c', 'g'], dtype='object')

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [67]:
df = pd.DataFrame(a)

In [29]:
print(df)

       0
d    400
b    300
a    200
c    100
100   60
450   50
800   40
g     30
f     20
e     10

What is the shape of the datafarme <br>
(also, what does it imply?)

In [68]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [70]:
# yep its same as the series.
print(a.index)

Index(['e', 'f', 'd', 'b', 'a', 'c', 'g'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [72]:
a.head()

e    800
f    450
d    400
b    300
a    200
dtype: int64

In [73]:
a.tail()

d    400
b    300
a    200
c    100
g    100
dtype: int64

Rename the column of the dataframe as 'points'

In [76]:

df = df.rename(columns={0:'points'})
print(df)

   points
e     800
f     450
d     400
b     300
a     200
c     100
g     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [77]:
#Create fruits array

fruits = ['Orange', 'Apple', 'Mango', 'Orange', 'Apple', 'Mango', 'Apple']

In [78]:
#Create series fruits out of fruits array

fruits = pd.Series(fruits)

Change the index of fruits to the index of dataframe df

In [80]:
fruits.index = df.index

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [82]:

df['fruits'] = fruits

In [84]:

df.head()

   points  fruits
e     800  Orange
f     450   Apple
d     400   Mango
b     300  Orange
a     200   Apple

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [87]:
d1 =  pd.DataFrame({'city':['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali' ], 'temparature':[15,22,20, 26, -2]})

Print(d1)

In [88]:

d1.head()

         city  temparature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [90]:
d1.shape

(5, 2)

Set city = d1['city']

In [92]:
city = d1['city']

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

print city <br>
What is the type of city.

In [95]:
print(city)

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [97]:
d2 = pd.DataFrame({'city': ['Bengalaru','Coimbatore','Srirangam','Pondicherry'],
'Temperature':[24,35,36,39]})

print the shape of this dataframe

In [98]:
print(d2)

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

merge the two dataframes together, save it in a new dataframe named 'd3'

In [105]:
d3 = pd.concat([d1, d2])
print(d3)

          city  temparature  Temperature
0   Chandigarh         15.0          NaN
1        Delhi         22.0          NaN
2       Kanpur         20.0          NaN
3      Chennai         26.0          NaN
4       Manali         -2.0          NaN
0    Bengalaru          NaN         24.0
1   Coimbatore          NaN         35.0
2    Srirangam          NaN         36.0
3  Pondicherry          NaN         39.0

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [111]:

filtered = d3[d3['temparature'] <= 20]
print(filtered)
print(len(filtered))

         city  temparature  Temperature
0  Chandigarh         15.0          NaN
2      Kanpur         20.0          NaN
4      Manali         -2.0          NaN
3

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [112]:

d3[d3['Temperature'] >= 35]

          city  temparature  Temperature
1   Coimbatore          NaN         35.0
2    Srirangam          NaN         36.0
3  Pondicherry          NaN         39.0

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [114]:
# write function here

def is_ut(x):
   if x in ['Chandigarh', 'Delhi', 'Pondicherry']:
       return True
   else:
       return False    

    
d3['is_ut'] = d3['city'].apply(is_ut)

In [115]:
# print d3
print(d3)

          city  temparature  Temperature  is_ut
0   Chandigarh         15.0          NaN   True
1        Delhi         22.0          NaN   True
2       Kanpur         20.0          NaN  False
3      Chennai         26.0          NaN  False
4       Manali         -2.0          NaN  False
0    Bengalaru          NaN         24.0  False
1   Coimbatore          NaN         35.0  False
2    Srirangam          NaN         36.0  False
3  Pondicherry          NaN         39.0   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [116]:
# write function here

def c_to_f(x):
    return  (x*9/5) + 32

In [117]:
# check function c_to_f(10)
c_to_f(10)

50.0

In [119]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3['temp_farenhiet'] = d3['Temperature'].apply(c_to_f)
print(d3)

          city  temparature  Temperature  is_ut  temp_farenhiet
0   Chandigarh         15.0          NaN   True             NaN
1        Delhi         22.0          NaN   True             NaN
2       Kanpur         20.0          NaN  False             NaN
3      Chennai         26.0          NaN  False             NaN
4       Manali         -2.0          NaN  False             NaN
0    Bengalaru          NaN         24.0  False            75.2
1   Coimbatore          NaN         35.0  False            95.0
2    Srirangam          NaN         36.0  False            96.8
3  Pondicherry          NaN         39.0   True           102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [122]:
union_territories = ['Chandigarh', 'Delhi', 'Pondicherry']
d1_ut = d1[d1['city'].isin(union_territories)]
print(d1_ut)

         city  temparature
0  Chandigarh           15
1       Delhi           22

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [130]:

d1_temp = d1[(d1['temparature'] * 9/5 + 32) > 90]
print(d1_temp)

Empty DataFrame
Columns: [city, temparature]
Index: []

Select only the first three rows of the dataframe d1.

In [132]:
d1[:3]

         city  temparature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20

Select all the rows and last two columns in the dataframe.

In [133]:
d1[::]

         city  temparature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

## Groupby

In [147]:
# Create a dataframe using dictionary of your choice

data = pd.DataFrame({'a':[1,2,3,1,2,3], 'b':[4,5,6,7,8,9], 'c': [10, 11, 12, 13, 14, 15] })
print(data)

   a  b   c
0  1  4  10
1  2  5  11
2  3  6  12
3  1  7  13
4  2  8  14
5  3  9  15

In [148]:
# Use Groupby of single column with aggregate sum()
data.groupby('a')['b'].sum()

a
1    11
2    13
3    15
Name: b, dtype: int64

In [149]:
# Use Groupby of single column with aggregate count()
data.groupby("a").count()

   b  c
a
1  2  2
2  2  2
3  2  2

In [150]:
# Use Groupby of single column with aggregate min() and max()
data.groupby('a')['b'].agg(['min','max'])

   min  max
a
1    4    7
2    5    8
3    6    9

In [152]:
# Use Groupby of any 2 columns with aggregate mean()
data.groupby(['a','b'])['c'].mean()

a  b
1  4    10.0
   7    13.0
2  5    11.0
   8    14.0
3  6    12.0
   9    15.0
Name: c, dtype: float64

In [155]:
# Use Groupby of any 2 columns with aggregate min() and max()
data.groupby(['a','b'])['c'].agg(['min', 'max'])

     min  max
a b
1 4   10   10
  7   13   13
2 5   11   11
  8   14   14
3 6   12   12
  9   15   15

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [163]:
a = pd.date_range(start='2020-01-01', end='2020-04-01', freq='D')

print a

In [164]:
print(a)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20',
               '2020-01-21', '2020-01-22', '2020-01-23', '2020-01-24',
               '2020-01-25', '2020-01-26', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30', '2020-01-31', '2020-02-01',
               '2020-02-02', '2020-02-03', '2020-02-04', '2020-02-05',
               '2020-02-06', '2020-02-07', '2020-02-08', '2020-02-09',
               '2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14', '2020-02-15', '2020-02-16', '2020-02-17',
               '2020-02-18', '2020-02-19', '2020-02-20', '2020-02-21',
               '2020-02-22', '2020-02-23', '2020-02-24', '2020-02-25',
               '2020-02-26', '2020-02-27', '2020-02-28', '2020-02-29',
               '2020-03-01', '2020-03-02', '2020-03-03', '2020-03-04',
               '2020-03-05', '2020-03-06', '2020-03-07', '2020-03-08',
               '2020-03-09', '2020-03-10', '2020-03-11', '2020-03-12',
               '2020-03-13', '2020-03-14', '2020-03-15', '2020-03-16',
               '2020-03-17', '2020-03-18', '2020-03-19', '2020-03-20',
               '2020-03-21', '2020-03-22', '2020-03-23', '2020-03-24',
               '2020-03-25', '2020-03-26', '2020-03-27', '2020-03-28',
               '2020-03-29', '2020-03-30', '2020-03-31', '2020-04-01'],
              dtype='datetime64[ns]', freq='D')

What is the len of a?

In [165]:
len(a)

92

What is the type of a?

In [166]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex